Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.SpecificHeatCapacityUnitEnum
The Mep specific heat capacity unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.SpecificHeatCapacityUnitEnum.JOULE_K_KG
Joule per Kelvin per kg.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.SpecificHeatCapacityUnitEnum.BTU_F_LB
British thermal unit per Fahrenheit per lb.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals.SpecificHeatCapacityUnitEnum.UNKNOWN
unknown unit.